Revit 2026 API

# InsulationTypeSet Constructor

---

Initializes a new instance of the InsulationTypeSet class

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public InsulationTypeSet()
```
```vb
Public Sub New
```
```cpp
public:
InsulationTypeSet()
```
```fsharp
new : unit -> InsulationTypeSet
```

#### Reference

InsulationTypeSet Class

Autodesk.Revit.DB.Electrical Namespace